## Plans :heavy_multiplication_x:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/07b2aee4-3b95-46d9-908a-91de36c22cc5).


Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

## Dir: . | :heavy_multiplication_x:
**Dir**: .
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:
```
{}
```
**Step**: init
**Success**: :thumbsup:
**Command**: `terraform init`
```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Finding latest version of dopplerhq/doppler...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/random v3.7.1...
- Installed hashicorp/random v3.7.1 (signed by HashiCorp)
- Installing dopplerhq/doppler v1.16.0...
- Installed dopplerhq/doppler v1.16.0 (self-signed, key ID D13E9DC04ACCB5E6)
- Installing hashicorp/aws v5.94.1...
- Installed hashicorp/aws v5.94.1 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpq8yiq813/plan`
```
╷
│ Error: reading API Gateway Method Response (agmr-wqp5ng76v9-dug870-GET-200): operation error API Gateway: GetMethodResponse, https response error StatusCode: 400, RequestID: 9f3f20cc-c7aa-4984-b80c-b6894523240a, api error ValidationException: 1 validation error detected: Value '2xx' at 'statusCode' failed to satisfy constraint: Member must satisfy regular expression pattern: [1-5]\d\d
│ 
│ 
╵

random_password.demo_password: Refreshing state... [id=none]
doppler_secret.demo_password: Refreshing state... [id=example-project.dev.DEMO_PASSWORD]
aws_api_gateway_method_response.weather_response: Refreshing state... [id=agmr-wqp5ng76v9-dug870-GET-200]
aws_api_gateway_rest_api.mock_api: Refreshing state... [id=wqp5ng76v9]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-execution-role]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=lambda-execution-role-20250411170917501100000001]
aws_api_gateway_resource.weather_resource: Refreshing state... [id=dug870]
aws_api_gateway_method.weather_get: Refreshing state... [id=agm-wqp5ng76v9-dug870-GET]
aws_api_gateway_integration.weather_integration: Refreshing state... [id=agi-wqp5ng76v9-dug870-GET]
aws_api_gateway_deployment.mock_api: Refreshing state... [id=sdkwx0]
aws_lambda_function.mock_api_lambda: Refreshing state... [id=mock-api-test-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_api_gateway_deployment.mock_api must be replaced
-/+ resource "aws_api_gateway_deployment" "mock_api" {
!       created_date  = "2025-04-11T17:09:19Z" -> (known after apply)
!       execution_arn = "arn:aws:execute-api:eu-west-1:***:wqp5ng76v9/test" -> (known after apply)
!       id            = "sdkwx0" -> (known after apply)
!       invoke_url    = "https://wqp5ng76v9.execute-api.eu-west-1.amazonaws.com/test" -> (known after apply)
-       stage_name    = "test" -> null # forces replacement
+       triggers      = (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.weather_integration will be updated in-place
!   resource "aws_api_gateway_integration" "weather_integration" {
        id                   = "agi-wqp5ng76v9-dug870-GET"
!       request_templates    = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
!           "application/json" = (sensitive value)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.weather_response_200 will be created
+   resource "aws_api_gateway_method_response" "weather_response_200" {
+       http_method     = "GET"
+       id              = (known after apply)
+       resource_id     = "dug870"
+       response_models = {
+           "application/json" = "Empty"
        }
+       rest_api_id     = "wqp5ng76v9"
+       status_code     = "200"
    }

  # aws_api_gateway_method_response.weather_response_403 will be created
+   resource "aws_api_gateway_method_response" "weather_response_403" {
+       http_method     = "GET"
+       id              = (known after apply)
+       resource_id     = "dug870"
+       response_models = {
+           "application/json" = "Empty"
        }
+       rest_api_id     = "wqp5ng76v9"
+       status_code     = "403"
    }

  # aws_api_gateway_stage.mock_api_stage will be created
+   resource "aws_api_gateway_stage" "mock_api_stage" {
+       arn           = (known after apply)
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       rest_api_id   = "wqp5ng76v9"
+       stage_name    = "test"
+       tags_all      = (known after apply)
+       web_acl_arn   = (known after apply)
    }

  # aws_lambda_function.mock_api_lambda will be updated in-place
!   resource "aws_lambda_function" "mock_api_lambda" {
        id                             = "mock-api-test-function"
        tags                           = {}
        # (24 unchanged attributes hidden)

!       environment {
!           variables = {
-               "MOCK_API_KEY" = (sensitive value)
-               "MOCK_API_URL" = "https://wqp5ng76v9.execute-api.eu-west-1.amazonaws.com/test/weather"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 1 to destroy.

Changes to Outputs:
-   lambda_function_arn = "arn:aws:lambda:eu-west-1:***:function:mock-api-test-function" -> null
-   mock_api_url        = "https://wqp5ng76v9.execute-api.eu-west-1.amazonaws.com/test/weather" -> null
-   resource_value      = "!_hm+%kRWyXIuKvBENbqLVgG%8Cf5EZh" -> null
Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
